[
  {
    "image": "https://i.ibb.co.com/kVqtFRn8/Whats-App-Messenger.jpg",
    "title": "WhatsApp Messenger",
    "companyName": "Meta Platforms Inc.",
    "id": 1,
    "description": "WhatsApp Messenger is a globally recognized messaging application developed by Meta Platforms Inc., providing a reliable, fast, and secure way for people to communicate. Since its launch in 2009, it has transformed personal and professional communication by offering instant text messaging, voice calls, and video calls. Users can share photos, videos, documents, and even real-time locations, making conversations interactive and convenient. One of the most important features is its end-to-end encryption, which ensures privacy and security for all messages, voice notes, and media shared within the app. WhatsApp supports group chats, allowing families, friends, and colleagues to collaborate seamlessly. With cross-platform availability on Android, iOS, and desktop devices, users remain connected anywhere in the world. Beyond personal use, WhatsApp has expanded to WhatsApp Business, enabling companies to interact with customers, provide support, and promote services effectively. Additional features like status updates, multimedia sharing, voice notes, and video calls make the app versatile and engaging. Continuous updates, new features, and improvements in user experience have helped WhatsApp maintain its position as one of the most trusted and widely used messaging apps globally. With billions of active users, WhatsApp has become an essential tool for communication, social connectivity, and business interactions worldwide, combining ease of use, security, and innovative features to meet the needs of modern digital communication.",
    "size": 45,
    "reviews": 120000000,
    "ratingAvg": 4.5,
    "downloads": 5,
    "ratings": [
      { "name": "1 star", "count": 2000000 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": 5000000 },
      { "name": "4 star", "count": 30000000 },
      { "name": "5 star", "count": 80000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/gLfM9bc2/instagram.jpg",
    "title": "Instagram",
    "companyName": "Meta Platforms Inc.",
    "id": 2,
    "description": "Instagram, developed by Meta Platforms Inc., is one of the world’s leading social media platforms, designed to help users share their life moments through photos, videos, and reels. Since its launch, Instagram has transformed the way people connect, express themselves, and explore content online. Users can capture and edit images using a variety of filters, effects, and creative tools, allowing for visually stunning posts. Beyond personal sharing, Instagram provides interactive features such as Stories, IGTV, Reels, and Live videos, enabling real-time engagement and authentic communication with followers. Its intuitive interface and algorithmic feed help users discover trending content, explore new interests, and follow influencers, brands, or friends. Instagram also serves as a powerful platform for businesses, creators, and marketers, offering tools for advertising, analytics, and e-commerce through Instagram Shopping, promoting products, services, and brand awareness globally. With a focus on visual storytelling, Instagram encourages community building and creative expression while keeping user engagement high through likes, comments, shares, and direct messaging. The platform ensures cross-device accessibility, supporting both mobile and web, so users can stay connected anywhere, anytime. Over the years, Instagram has continuously introduced innovative features like augmented reality filters, interactive polls, and collaborative content, making it a dynamic, versatile, and indispensable tool for social networking, creative expression, and digital marketing. Its global reach, ease of use, and powerful engagement tools have made Instagram an essential platform for millions seeking connection, inspiration, and entertainment in today’s digital age.",
    "size": 60,
    "reviews": 98000000,
    "ratingAvg": 4.4,
    "downloads": 4,
    "ratings": [
      { "name": "1 star", "count": 3000000 },
      { "name": "2 star", "count": 2000000 },
      { "name": "3 star", "count": 8000000 },
      { "name": "4 star", "count": 25000000 },
      { "name": "5 star", "count": 62000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/b5HXcyzM/tik-tok.png",
    "title": "TikTok",
    "companyName": "ByteDance Ltd.",
    "id": 3,
    "description": "TikTok, developed by ByteDance Ltd., is a globally popular short-form video platform that has revolutionized the way people create, share, and consume content. Launched to bring creativity to everyone, TikTok allows users to record and edit videos ranging from a few seconds to a minute using an extensive collection of music, effects, and filters. Its intuitive interface, algorithmic personalized feed, and trending challenges ensure that content reaches the right audience quickly, making it a hub for viral trends and global entertainment. Users can participate in hashtags, duets, stitches, and collaborative content, fostering interactive engagement and community building. TikTok has become a powerful platform for creators, influencers, and brands, offering opportunities for exposure, digital marketing, and monetization through its Creator Fund and brand partnerships. Its cross-platform compatibility ensures seamless access on mobile devices, keeping users connected anytime, anywhere. Beyond entertainment, TikTok serves as an educational and informative platform, with a wide range of content including tutorials, life hacks, motivational clips, and cultural insights. The platform encourages self-expression, creativity, and discovery, allowing users of all ages to share their talents, stories, and experiences in innovative ways. With billions of active users worldwide, TikTok continues to evolve by introducing new features, enhancing user experience, and shaping modern digital culture. Its combination of simplicity, entertainment value, and virality has made TikTok an essential app for entertainment, social interaction, and global content sharing.",
    "size": 85,
    "reviews": 65000000,
    "ratingAvg": 4.6,
    "downloads": 3,
    "ratings": [
      { "name": "1 star", "count": 1500000 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 20000000 },
      { "name": "5 star", "count": 40000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/HLH4HH73/youtube-logo-featured.jpg",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 4,
    "description": "YouTube, developed by Google LLC, is the world’s largest and most popular video-sharing platform, connecting billions of users globally. Since its inception in 2005, YouTube has transformed the way people create, share, and consume video content, offering a platform for entertainment, education, news, and social engagement. Users can upload videos, stream live broadcasts, and explore an endless variety of content, from music videos, movies, and tutorials to vlogs, educational lectures, and trending viral clips. Its sophisticated recommendation algorithm ensures that viewers discover content tailored to their interests, while features like playlists, subscriptions, and watch later provide personalized viewing experiences. YouTube also empowers creators with monetization options through ad revenue, memberships, super chats, and partnerships, enabling talented individuals and brands to reach global audiences and build communities around their content. The platform is highly accessible across devices including smartphones, tablets, desktops, and smart TVs, ensuring seamless streaming anywhere and anytime. Beyond entertainment, YouTube serves as an educational hub with tutorials, DIY guides, skill development courses, and informative documentaries. With community features like comments, likes, and shares, users can interact and engage with creators and fellow viewers, fostering meaningful discussions and collaboration. Constantly evolving, YouTube continues to innovate with new tools, enhanced video quality, shorts, and live streaming capabilities, maintaining its position as a cornerstone of digital media and online content sharing. Its combination of accessibility, diversity, and global reach makes YouTube an indispensable platform for learning, creativity, entertainment, and connection.",
    "size": 95,
    "reviews": 180000000,
    "ratingAvg": 4.7,
    "downloads": 4,
    "ratings": [
      { "name": "1 star", "count": 5000000 },
      { "name": "2 star", "count": 3000000 },
      { "name": "3 star", "count": 10000000 },
      { "name": "4 star", "count": 35000000 },
      { "name": "5 star", "count": 130000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/WpY2xNhC/snapchat.jpg",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "id": 5,
    "description": "Snapchat, developed by Snap Inc., is a leading multimedia messaging app that has revolutionized digital communication with its unique focus on ephemeral content. Since its launch in 2011, Snapchat has enabled users to send photos, videos, and messages that disappear after being viewed, creating a sense of privacy and spontaneity that sets it apart from traditional messaging platforms. The app offers an array of creative tools including filters, lenses, stickers, augmented reality (AR) effects, and Bitmojis, allowing users to enhance their snaps and express themselves in fun and innovative ways. Beyond one-to-one messaging, Snapchat supports group chats, stories, and public content sharing, enabling users to document and share their daily lives with friends, family, and followers. Its Discover section features curated content from publishers, celebrities, and creators, providing entertainment, news, and educational content in a visually engaging format. Snapchat also emphasizes social interaction and community, offering features like Snap Map to see friends’ locations and real-time events, and Spotlight for showcasing viral user-generated content. The platform continually evolves with new features like AR games, interactive experiences, and integration with third-party apps, maintaining its position as a dynamic and trend-setting social media platform. With millions of active users worldwide, Snapchat has become a central hub for communication, creativity, and social connection, appealing particularly to younger audiences who value innovation, engagement, and authentic digital interactions. Its combination of privacy, entertainment, and interactivity makes Snapchat a unique and essential app in the modern social media landscape.",
    "size": 75,
    "reviews": 45000000,
    "ratingAvg": 4.3,
    "downloads": 5,
    "ratings": [
      { "name": "1 star", "count": 4000000 },
      { "name": "2 star", "count": 3000000 },
      { "name": "3 star", "count": 5000000 },
      { "name": "4 star", "count": 12000000 },
      { "name": "5 star", "count": 21000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/78SM0wg/spotify-logo.jpg",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "id": 6,
    "description": "Spotify, developed by Spotify AB, is one of the world’s leading music streaming platforms, providing users with instant access to millions of songs, albums, playlists, and podcasts from artists across the globe. Since its launch in 2008, Spotify has transformed the way people discover, listen to, and share music, offering a seamless and personalized experience through advanced algorithms that recommend tracks based on individual tastes and listening habits. Users can create their own playlists, follow favorite artists, and explore curated playlists for different moods, genres, and activities. Spotify’s free tier allows access to a vast music library with ads, while the premium subscription offers ad-free listening, offline playback, and higher audio quality. Beyond music, Spotify has become a hub for podcasts, providing content on topics ranging from entertainment and education to news and culture, making it a versatile platform for audio content consumption. The app supports cross-platform usage, allowing users to stream music on smartphones, tablets, desktops, smart speakers, and connected devices, ensuring an uninterrupted experience anytime, anywhere. Spotify also fosters social interaction by enabling users to share playlists, collaborate on music collections, and connect with friends to see what they are listening to. With innovative features like Spotify Wrapped, real-time lyrics, and integration with third-party apps, Spotify continuously enhances user engagement and redefines digital music experiences. Its combination of personalization, accessibility, and a massive content library has made Spotify an indispensable tool for music lovers worldwide.",
    "size": 65,
    "reviews": 90000000,
    "ratingAvg": 4.8,
    "downloads": 4,
    "ratings": [
      { "name": "1 star", "count": 1500000 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": 4000000 },
      { "name": "4 star", "count": 20000000 },
      { "name": "5 star", "count": 65000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/GvhSPZ86/telegram.jpg",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 7,
    "description": "Telegram, developed by Telegram FZ-LLC, is a fast, secure, and cloud-based messaging platform that has revolutionized digital communication by providing users with a seamless and versatile way to connect with friends, family, and communities worldwide. Launched in 2013, Telegram focuses on privacy, speed, and reliability, offering end-to-end encryption for secret chats, self-destructing messages, and secure cloud storage that allows users to access their messages from multiple devices simultaneously. Beyond standard messaging, Telegram supports group chats with thousands of members, channels for broadcasting information to large audiences, and robust file-sharing capabilities, including documents, photos, videos, and other multimedia content. Its intuitive interface, combined with advanced features like bots, custom stickers, polls, and interactive media, enhances user engagement and collaboration. Telegram’s open API and developer-friendly environment encourage the creation of custom apps, tools, and integrations, making it highly adaptable for personal, professional, and business communication. Additionally, the platform prioritizes security, ensuring that sensitive information remains protected while offering seamless synchronization across smartphones, tablets, and desktops. With millions of active users worldwide, Telegram has become a popular choice for individuals, communities, and organizations seeking a reliable, private, and feature-rich messaging experience. Its combination of speed, privacy, flexibility, and powerful functionality makes Telegram one of the leading communication platforms in the modern digital landscape, redefining how people connect and collaborate globally.",
    "size": 45,
    "reviews": 37000000,
    "ratingAvg": 4.6,
    "downloads": 15,
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 9000000 },
      { "name": "5 star", "count": 25000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/5x9dsmTJ/Facebook-Feature.jpg",
    "title": "Facebook",
    "companyName": "Meta Platforms Inc.",
    "id": 8,
    "description": "Facebook, developed by Meta Platforms Inc., is one of the most influential social networking platforms in the world, connecting billions of people across the globe. Launched in 2004, Facebook has transformed the way individuals interact, share information, and build communities online. The platform allows users to create personal profiles, share photos, videos, and status updates, and engage with friends, family, and followers through likes, comments, and shares. Beyond personal connections, Facebook provides tools for group creation, event organization, and community building, enabling people with shared interests to come together and collaborate. Facebook’s powerful news feed algorithm ensures that users stay updated on relevant content, while its marketplace feature allows buying and selling of products locally. The platform also supports businesses through Facebook Pages, advertising solutions, and analytics tools, helping companies reach their target audiences effectively. Security and privacy features, including account settings, content moderation, and reporting tools, help maintain a safe online environment. Over the years, Facebook has expanded its ecosystem by integrating with Instagram, WhatsApp, and Messenger, providing a unified experience across multiple apps. With continuous innovations in features, multimedia sharing, and social interactions, Facebook remains a cornerstone of digital communication, fostering connections, information sharing, and engagement on a global scale.",
    "size": 70,
    "reviews": 130000000,
    "ratingAvg": 4.2,
    "downloads": 8,
    "ratings": [
      { "name": "1 star", "count": 8000000 },
      { "name": "2 star", "count": 6000000 },
      { "name": "3 star", "count": 15000000 },
      { "name": "4 star", "count": 35000000 },
      { "name": "5 star", "count": 66000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/C5tsZ1Rg/pinterest.png",
    "title": "Pinterest",
    "companyName": "Pinterest Inc.",
    "id": 9,
    "description": "Pinterest, developed by Pinterest Inc., is a popular visual discovery and bookmarking platform that allows users to explore, save, and share creative ideas from around the world. Launched in 2010, Pinterest has become a go-to platform for individuals seeking inspiration in areas such as fashion, home decor, cooking, DIY projects, travel, and more. Users can create boards to organize their favorite pins, follow other users with similar interests, and discover trending ideas tailored to their preferences. Pinterest combines the power of social networking with a visual search engine, making it easy for users to find step-by-step tutorials, innovative designs, and unique content that sparks creativity. The platform also supports businesses and content creators by providing tools for promoting products, driving traffic, and engaging with potential customers through visually appealing pins. With smart recommendations, personalized feeds, and advanced search features, Pinterest ensures that users can quickly find ideas relevant to their interests and projects. Its mobile and web applications offer seamless browsing, saving, and sharing capabilities, making it accessible anywhere, anytime. Pinterest emphasizes inspiration, creativity, and self-expression, providing a digital space where individuals can explore their passions, plan projects, and gather ideas in an organized and visually engaging manner. With millions of active users globally, Pinterest continues to grow as a hub for discovering trends, cultivating creativity, and transforming imagination into actionable ideas.",
    "size": 55,
    "reviews": 25000000,
    "ratingAvg": 4.5,
    "downloads": 9,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "5 star", "count": 18000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Y4Tncmgt/twitter-x.png",
    "title": "X (Twitter)",
    "companyName": "X Corp.",
    "id": 10,
    "description": "X (formerly known as Twitter), developed by X Corp., is a globally recognized social media platform that allows users to share thoughts, ideas, news, and multimedia content in real-time. Since its inception, X has transformed the way people communicate online, providing a fast and concise medium for expressing opinions, staying informed, and engaging in conversations. Users can post tweets, reply to others, like, retweet, and follow accounts that match their interests, creating a dynamic and interactive social network. The platform is particularly known for its real-time news updates, trending topics, and the ability to participate in public discourse across various fields including politics, entertainment, sports, and technology. X also supports multimedia content such as images, videos, and polls, enhancing engagement and interaction. For businesses, influencers, and brands, X provides powerful tools for marketing, audience engagement, and brand awareness, allowing them to connect directly with followers and promote content effectively. With features like verified accounts, hashtags, and advanced search, X ensures that users can find relevant content quickly and engage with communities of shared interests. Its mobile and web applications offer seamless browsing, posting, and networking capabilities, keeping users connected anytime, anywhere. X emphasizes communication, connectivity, and information sharing, making it an essential platform for individuals and organizations looking to stay updated, voice their opinions, and engage with global communities. With millions of active users worldwide, X continues to be a cornerstone of modern social media and digital interaction.",
    "size": 58,
    "reviews": 60000000,
    "ratingAvg": 4.1,
    "downloads": 4,
    "ratings": [
      { "name": "1 star", "count": 5000000 },
      { "name": "2 star", "count": 4000000 },
      { "name": "3 star", "count": 7000000 },
      { "name": "4 star", "count": 12000000 },
      { "name": "5 star", "count": 32000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/ZRMT6Fh0/zoom.png",
    "title": "Zoom",
    "companyName": "Zoom Video Communications",
    "id": 11,
    "description": "Zoom, developed by Zoom Video Communications, is a leading cloud-based video conferencing platform that has revolutionized the way people connect, collaborate, and communicate globally. Since its launch, Zoom has become an essential tool for businesses, educators, and individuals, offering high-quality video and audio meetings, webinars, and virtual events. Its intuitive interface allows users to schedule, host, and join meetings effortlessly from desktops, laptops, and mobile devices, ensuring seamless communication regardless of location. Zoom provides robust features including screen sharing, virtual backgrounds, breakout rooms, recording capabilities, chat functions, and real-time collaboration tools, making remote work, online learning, and virtual events more efficient and interactive. With end-to-end encryption and advanced security measures, Zoom ensures that all meetings remain private and secure, building trust among users worldwide. The platform supports large-scale events with hundreds or even thousands of participants, making it ideal for corporate conferences, training sessions, and webinars. Zoom's reliability, ease of use, and cross-platform compatibility have contributed to its rapid adoption and global popularity. Beyond professional use, Zoom has also become a tool for social interaction, enabling friends, families, and communities to stay connected virtually. Its continuous innovation, user-friendly features, and commitment to high-quality communication have solidified Zoom's position as a cornerstone in modern digital communication, bridging distances and fostering collaboration across the world.",
    "size": 90,
    "reviews": 28000000,
    "ratingAvg": 4.6,
    "downloads": 9,
    "ratings": [
      { "name": "1 star", "count": 700000 },
      { "name": "2 star", "count": 500000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 7000000 },
      { "name": "5 star", "count": 18000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/qLxDsGJB/duolingopng.png",
    "title": "Duolingo",
    "companyName": "Duolingo Inc.",
    "id": 12,
    "description": "Duolingo, developed by Duolingo Inc., is a highly popular language learning platform that offers an engaging and interactive way for users to learn new languages for free. Since its launch, Duolingo has transformed language education by providing bite-sized lessons, gamified exercises, quizzes, and rewards that motivate learners to practice consistently. The platform supports dozens of languages, allowing users to read, write, speak, and listen in their target language, while tracking their progress through a personalized learning path. Duolingo uses adaptive technology to adjust the difficulty of exercises based on the learner’s performance, ensuring a customized learning experience. It also offers streaks, leaderboards, and badges, which gamify the process and encourage daily engagement. Beyond individual learning, Duolingo supports classroom and group activities, making it a valuable tool for teachers and educators. Its mobile-friendly design allows learning on the go, enabling users to fit language practice into their daily routine effortlessly. With a focus on accessibility, Duolingo makes language education available to millions worldwide, breaking down barriers of geography and socio-economic status. The platform continuously adds new features such as Duolingo Stories, podcasts, and interactive speaking exercises to enhance comprehension and retention. Its combination of effective pedagogy, engaging design, and user-friendly interface has made Duolingo a cornerstone of modern language learning, helping millions of learners gain confidence and fluency in new languages.",
    "size": 35,
    "reviews": 42000000,
    "ratingAvg": 4.8,
    "downloads": 7,
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "4 star", "count": 6000000 },
      { "name": "5 star", "count": 34000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/TxHKNYXN/netflix.png",
    "title": "Netflix",
    "companyName": "Netflix Inc.",
    "id": 13,
    "description": "Netflix, developed by Netflix Inc., is a leading global streaming platform that has revolutionized the way people consume movies, TV shows, and original content. Since its inception, Netflix has grown to become a household name, offering a vast library of films, series, documentaries, and exclusive Netflix Originals that cater to diverse tastes and interests. Its intuitive interface allows users to easily browse, search, and discover content across various genres, including drama, comedy, action, thriller, and animation. Netflix uses advanced algorithms and personalized recommendations to suggest titles based on viewers’ preferences, enhancing the overall user experience and engagement. The platform supports multiple devices, including smart TVs, smartphones, tablets, and computers, allowing users to watch content anytime and anywhere. With high-quality streaming options, offline downloads, and adaptive bandwidth management, Netflix ensures a seamless viewing experience even in areas with varying internet speeds. Beyond entertainment, Netflix has also become a cultural phenomenon, influencing trends, sparking conversations, and shaping the global entertainment industry. Its investment in original programming and international content has allowed it to appeal to audiences worldwide, breaking language and cultural barriers. Netflix continues to innovate with interactive storytelling, cinematic experiences, and immersive formats, making it more than just a streaming service. With millions of subscribers globally, Netflix remains a cornerstone of modern digital entertainment, providing endless entertainment, convenience, and inspiration to audiences of all ages.",
    "size": 120,
    "reviews": 85000000,
    "ratingAvg": 4.6,
    "downloads": 6,
    "ratings": [
      { "name": "1 star", "count": 2000000 },
      { "name": "2 star", "count": 1000000 },
      { "name": "3 star", "count": 3000000 },
      { "name": "4 star", "count": 15000000 },
      { "name": "5 star", "count": 64000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/bMvrc427/uber.jpg",
    "title": "Uber",
    "companyName": "Uber Technologies Inc.",
    "id": 14,
    "description": "Uber, developed by Uber Technologies Inc., is a pioneering ride-hailing and mobility platform that has transformed urban transportation worldwide. Launched with the vision of making transportation reliable, convenient, and accessible, Uber allows users to book rides quickly through its intuitive app interface. The platform connects riders with drivers in real time, offering a variety of ride options, from affordable shared trips to premium services, ensuring a solution for every travel need. Uber’s GPS-enabled system provides accurate pickup and drop-off locations, route optimization, and estimated arrival times, enhancing the overall user experience. Beyond personal rides, Uber has expanded into multiple services, including Uber Eats for food delivery, Uber Freight for logistics, and Uber for Business to facilitate corporate travel. Safety is a core focus, with features like driver background checks, in-app emergency assistance, trip tracking, and ratings systems to maintain transparency and trust. The platform also supports cashless payments, digital receipts, and easy trip management, simplifying everyday transportation. Uber has created significant economic opportunities for drivers, offering flexible income options and a scalable platform for entrepreneurship. By leveraging technology, data analytics, and continuous innovation, Uber has redefined urban mobility, reduced wait times, and improved access to transportation across cities globally. With millions of users and a global presence, Uber continues to expand its services, shaping the future of mobility and setting new standards for convenience, reliability, and efficiency in on-demand transportation.",
    "size": 80,
    "reviews": 48000000,
    "ratingAvg": 4.2,
    "downloads": 9,
    "ratings": [
      { "name": "1 star", "count": 4000000 },
      { "name": "2 star", "count": 3000000 },
      { "name": "3 star", "count": 6000000 },
      { "name": "4 star", "count": 11000000 },
      { "name": "5 star", "count": 24000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/q3Q8vTNj/airbnd.jpg",
    "title": "Airbnb",
    "companyName": "Airbnb Inc.",
    "id": 15,
    "description": "Airbnb, developed by Airbnb Inc., is a global online marketplace that has revolutionized the way people travel and experience accommodations. Launched with the mission to help people belong anywhere, Airbnb connects travelers with hosts offering unique homes, apartments, and experiences worldwide. The platform provides a seamless booking process, detailed property listings, high-quality photos, reviews, and transparent pricing, ensuring travelers can find accommodations that match their preferences and budget. Beyond lodging, Airbnb offers curated experiences, allowing users to participate in local tours, workshops, and cultural activities hosted by residents, creating authentic travel memories. Safety and trust are central to Airbnb, with verified profiles, secure payment systems, host ratings, and 24/7 support for both guests and hosts. The platform empowers hosts to monetize their spaces, providing income opportunities and promoting local economic growth. Airbnb’s flexible policies and responsive customer service enhance user confidence, making travel planning convenient and reliable. By leveraging technology, Airbnb simplifies global travel while fostering community connections, cultural exchange, and sustainability. The platform has expanded its offerings to include long-term stays, business travel solutions, and luxury properties, catering to diverse traveler needs. With millions of listings across over 190 countries, Airbnb continues to redefine modern travel, emphasizing unique experiences, accessibility, and a sense of belonging for travelers and hosts alike.",
    "size": 70,
    "reviews": 22000000,
    "ratingAvg": 4.7,
    "downloads": 5,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 800000 },
      { "name": "4 star", "count": 4000000 },
      { "name": "5 star", "count": 16500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/TxbPSG7k/reddit.jpg",
    "title": "Reddit",
    "companyName": "Reddit Inc.",
    "id": 16,
    "description": "Reddit, developed by Reddit Inc., is one of the world’s largest online communities, offering a platform where millions of users engage in discussions, share content, and explore topics of interest across countless communities known as 'subreddits.' Each subreddit focuses on a specific subject, ranging from news, technology, entertainment, hobbies, education, and personal experiences, to niche interests, allowing users to find content tailored to their passions. Reddit provides a unique environment for both sharing and discovering content through text posts, images, videos, polls, and links. The platform encourages open discussion and community-driven moderation, with users able to upvote or downvote content, influencing its visibility and fostering meaningful conversations. Beyond entertainment and social interaction, Reddit has become a valuable source of information, news, and real-time trends, enabling users to learn, debate, and connect globally. Its anonymous and semi-anonymous nature allows users to express opinions freely, seek advice, and engage in communities without revealing personal identity. Reddit also supports AMA (Ask Me Anything) sessions, live discussions, and collaborative projects, enhancing engagement between public figures, experts, and ordinary users. With millions of active users worldwide, Reddit combines social networking, knowledge sharing, and community engagement, making it an essential platform for interaction, discovery, and global connection in the digital era.",
    "size": 55,
    "reviews": 15000000,
    "ratingAvg": 4.3,
    "downloads": 9,
    "ratings": [
      { "name": "1 star", "count": 1000000 },
      { "name": "2 star", "count": 800000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 5000000 },
      { "name": "5 star", "count": 6200000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/5h6b3yNk/linkedin.png",
    "title": "LinkedIn",
    "companyName": "LinkedIn Corporation",
    "id": 17,
    "description": "LinkedIn, developed by LinkedIn Corporation, is the world’s largest professional networking platform, designed to help individuals build, expand, and maintain their professional connections. Launched in 2003, LinkedIn provides a space where professionals from various industries can create detailed profiles showcasing their work experience, education, skills, and achievements. Users can connect with colleagues, mentors, industry leaders, and potential employers, fostering meaningful professional relationships and opportunities. LinkedIn is not only a networking tool but also a powerful platform for career development, job hunting, and professional branding. Companies and organizations use LinkedIn to post job openings, share updates, and promote their services, while users can follow companies, join industry-specific groups, and engage with thought leaders through posts and discussions. The platform also offers features like LinkedIn Learning, enabling members to access courses and certifications to enhance skills and advance careers. Additionally, LinkedIn facilitates professional content sharing, thought leadership, and industry insights, making it a hub for knowledge exchange and professional growth. Its global reach connects millions of professionals across countries and industries, promoting collaboration, recruitment, and innovation. With its emphasis on credibility, professional reputation, and networking, LinkedIn has become an essential tool for career advancement, business development, and staying informed about trends in the ever-evolving professional world.",
    "size": 65,
    "reviews": 30000000,
    "ratingAvg": 4.4,
    "downloads": 4,
    "ratings": [
      { "name": "1 star", "count": 1200000 },
      { "name": "2 star", "count": 800000 },
      { "name": "3 star", "count": 2500000 },
      { "name": "4 star", "count": 8000000 },
      { "name": "5 star", "count": 17500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/xKGdCGf4/Discord-Logo.png",
    "title": "Discord",
    "companyName": "Discord Inc.",
    "id": 18,
    "description": "Discord, developed by Discord Inc., is a leading communication platform designed for communities, gamers, and professionals to connect seamlessly through voice, video, and text. Since its launch in 2015, Discord has transformed online interaction by providing dedicated spaces called servers, where members can join channels for specific topics, discussions, or activities. Users can create private or public servers, organize conversations into text channels, and host real-time voice or video chats, making communication more structured and interactive. Discord supports screen sharing, video streaming, and live events, enhancing collaboration and engagement within communities. Beyond gaming, Discord has expanded to accommodate study groups, hobbyist communities, professional teams, and social organizations, offering a versatile environment for group interaction. The platform emphasizes user-friendly features, including role management, customizable permissions, and integration with apps and bots to automate tasks, moderate content, and enhance server functionality. Security and privacy are core priorities, with advanced settings to control member access, content sharing, and notifications. Discord also offers cross-platform compatibility, enabling users to stay connected from desktops, mobile devices, or web browsers without missing important conversations. With millions of active users worldwide, Discord fosters creativity, collaboration, and community building, making it an essential tool for gamers, content creators, and anyone looking to communicate effectively and build vibrant online communities.",
    "size": 90,
    "reviews": 21000000,
    "ratingAvg": 4.7,
    "downloads": 5,
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 400000 },
      { "name": "3 star", "count": 1000000 },
      { "name": "4 star", "count": 4000000 },
      { "name": "5 star", "count": 15000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/0V9KBxjf/canva-cn-icon.png",
    "title": "Canva",
    "companyName": "Canva Pty Ltd.",
    "id": 19,
    "description": "Canva, developed by Canva Pty Ltd., is a powerful and user-friendly graphic design platform that allows individuals and businesses to create stunning visuals with ease. Since its launch in 2013, Canva has revolutionized design by providing a drag-and-drop interface, pre-made templates, and an extensive library of photos, illustrations, icons, and fonts. Users can design a wide range of content, including social media graphics, presentations, posters, flyers, business cards, invitations, and more, without requiring advanced design skills. Canva supports real-time collaboration, enabling teams to work together on projects, share feedback, and make edits seamlessly from anywhere in the world. Its versatility extends to marketing, education, personal projects, and professional branding, empowering users to produce high-quality content efficiently. Canva integrates with other tools, supports exporting in multiple formats, and offers cloud storage, making it convenient for users to access their designs on any device. The platform continuously innovates with new features such as animation, video editing, and AI-powered design suggestions, enhancing creativity and productivity. Canva emphasizes accessibility and simplicity, making design approachable for beginners while providing advanced features for professionals. With millions of users globally, Canva has become an essential platform for creative expression, visual communication, and content creation, enabling anyone to bring their ideas to life with professional-quality designs.",
    "size": 50,
    "reviews": 27000000,
    "ratingAvg": 4.8,
    "downloads": 9,
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 300000 },
      { "name": "3 star", "count": 800000 },
      { "name": "4 star", "count": 4000000 },
      { "name": "5 star", "count": 21000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/0HNFD1p/paypal.png",
    "title": "PayPal",
    "companyName": "PayPal Holdings Inc.",
    "id": 20,
    "description": "PayPal, developed by PayPal Holdings Inc., is a leading online payment platform that enables individuals and businesses to send and receive money securely and efficiently across the globe. Since its founding in 1998, PayPal has transformed digital commerce by providing a trusted, user-friendly platform for financial transactions, supporting multiple currencies and payment methods. Users can link their bank accounts, credit cards, and debit cards to make payments for online shopping, send money to friends and family, or receive funds for goods and services. PayPal offers advanced security measures, including fraud detection, encryption, and buyer protection, ensuring that transactions are safe and reliable. Beyond personal payments, PayPal supports merchants and businesses with tools for invoicing, payment processing, subscription services, and integration with e-commerce platforms, making it easier to manage finances and grow online businesses. The platform also offers features such as PayPal.Me links, QR code payments, and digital wallets, enhancing convenience for users worldwide. With mobile apps available for iOS and Android, PayPal ensures seamless, on-the-go access to accounts and transactions. The company continuously innovates by introducing solutions like cryptocurrency support, PayPal Credit, and PayPal Business Debit Mastercard, catering to evolving financial needs. Trusted by hundreds of millions of users, PayPal remains a cornerstone of global digital payments, providing speed, security, and convenience for personal and professional financial activities.",
    "size": 40,
    "reviews": 31000000,
    "ratingAvg": 4.5,
    "downloads": 6,
    "ratings": [
      { "name": "1 star", "count": 800000 },
      { "name": "2 star", "count": 600000 },
      { "name": "3 star", "count": 2000000 },
      { "name": "4 star", "count": 8000000 },
      { "name": "5 star", "count": 19000000 }
    ]
  }
]
